import { BookType } from '@/types';

export const booksData: BookType[] = [
  {
    id: 1,
    author: 'Фрэнсис Бернетт',
    title: 'Таинственный сад',
    cost: '7.72',
    description:
      'В центре романа Таинственный сад – десятилетняя Мери Леннокс, вернувшаяся из Индии в Англию после смерти родителей. В поместье ее дяди Арчибальда Крэвена Мери вынуждена привыкать к совершенно другой жизни, непохожей на ту, что была у нее до сих пор. Однажды девочка узнает о загадочном заброшенном саде, в который запрещено входить, и решает разыскать его. Вместе с новыми друзьями Мери предстоит проникнуть в тайны этого удивительного места, преображающего души людей.',
    img: '/img/book-id-1.jpg',
  },
  {
    id: 2,
    author: 'Мосян Тунсю',
    title: 'Благословение небожителей. Том 1',
    cost: '34.78',
    description:
      'В незапамятные времена Се Лянь был наследным принцем государства Сяньлэ. Судьба одарила его всем: прекрасным ликом, чистыми помыслами и бесконечной любовью своих подданных. И если уж кому-то и было предначертано стать Божеством, то именно Его Высочеству.Однако удержаться на Небесах оказалось для него не так просто. Се Лянь возносился дважды и дважды был изгнан на землю. И вот спустя восемьсот лет скитаний Его Высочество вновь возвращается в Небесные чертоги. Получив своё первое задание в роли Божества, он сталкивается с таинственным и невероятно могущественным демоном, который, как оказалось, уже давно положил глаз на наследного принца...',
    img: '/img/book-id-2.jpg',
  },
  {
    id: 3,
    author: 'Мосян Тунсю',
    title: 'Благословение небожителей. Том 3',
    cost: '34.78',
    description:
      'Для меня едино, окружён ты сиянием или повержен в грязь. Значение имеешь только ты сам.Близится Праздник середины осени, а вместе с ним – роскошный пир и Состязание фонарей в небесных чертогах. Отправляясь на торжество, Се Лянь не подозревает, что окажется в центре внимания. По возвращении в мир смертных он принимается за работу, ведь теперь нужно прокормить сразу три лишних рта! К несчастью, на задании, которое получил принц, он вновь сталкивается с озлобленным духом младенца, однако Хуа Чэн успевает прийти на выручку.После всей неразберихи герои решают отдохнуть – но не тут-то было! На пороге храма Водяных Каштанов возникает Ши Цинсюань в сопровождении Мин И. Оказывается, Повелителя Ветра уже довольно давно преследует одна тварь: божок-пустозвон. Се Лянь соглашается помочь и расправиться с ним, и тут дело принимает совсем дурной оборот...',
    img: '/img/book-id-3.jpg',
  },
  {
    id: 4,
    author: 'Агата Кристи',
    title: 'Десять негритят',
    cost: '8.82',
    description:
      'Десять никак не связанных между собой людей в особняке на уединенном острове... Кто вызвал их сюда таинственным приглашением? Зачем кто-то убивает их, одного за другим, самыми невероятными способами? Почему все происходящее так тесно переплетено с веселым детским стишком?',
    img: '/img/book-id-4.jpg',
  },
  {
    id: 5,
    author: 'Мосян Тунсю',
    title: 'Благословение небожителей. Том 2',
    cost: '34.78',
    description:
      'Всё в этом мире имеет счёт: и удача, и невезение.Беды преследуют Се Ляня одна за другой: вот он ненароком устроил поджог, а вот столкнулся с призраками прошлого, о которых предпочёл бы забыть...Восемьсот лет назад он был любимцем толпы, а матушка, отец и советник возлагали на него большие надежды. Слава о его подвигах стремительно достигла Небес, и в год своего семнадцатилетия Се Лянь вознёсся. Однако радость была скоротечна: в государстве Сяньлэ настали тяжёлые времена. Видя страдания своего народа, принц был не в силах остаться в стороне. Но может ли бог выбирать чью-то сторону?',
    img: '/img/book-id-5.jpg',
  },
  {
    id: 6,
    author: 'Мосян Тунсю',
    title: 'Благословение небожителей. Том 4',
    cost: '42.32',
    description:
      'Раз в сотню лет разгорается огонь в Медной Печи, и тысячи демонов откликаются на её зов. Они спешат к горе Тунлу – и каждый надеется выжить в смертельной схватке за право стать новым князем демонов. Предотвратить надвигающуюся угрозу по силам лишь небожителям.Но в столице бессмертных царит хаос: пленённая нечисть вырвалась на свободу, а боги войны заняты своими делами. Чтобы не допустить рождения очередного непревзойдённого, Се Лянь отправляется к вулкану в сопровождении Хуа Чэна, вынужденного скрывать свой истинный облик под личиной маленького мальчика...',
    img: '/img/book-id-6.jpg',
  },
  {
    id: 7,
    author: 'Оскар Уайльд',
    title: 'Портрет Дориана Грея',
    cost: '7.73',
    description:
      'Портрет Дориана Грея – самое знаменитое произведение Оскара Уайльда, единственный его роман, вызвавший в своё время шквал негативных оценок и тем не менее имевший невероятный успех.Главный герой романа, красавец Дориан, – фигура двойственная, неоднозначная. Тонкий эстет и романтик становится безжалостным преступником. Попытка сохранить свою необычайную красоту и молодость оборачивается провалом. Вместо героя стареет его портрет – но это не может продолжаться вечно, и смерть Дориана расставляет всё по своим местам.Роман Оскара Уайльда продолжает быть очень актуальным и сегодня – разве погоня за вечной молодостью порой не оборачивается потерей своего истинного лица?',
    img: '/img/book-id-7.jpg',
  },
  {
    id: 8,
    author: 'Джордж Оруэлл',
    title: '1984 (новый перевод)',
    cost: '9.49',
    description:
      'Своеобразный антипод второй великой антиутопии XX века О дивный новый мир Олдоса Хаксли. Что, в сущности, страшнее: доведенное до абсурда общество появления или доведенное до абсолюта общество идеи? По Оруэллу, нет и не может быть ничего ужаснее тотальной несвободы...',
    img: '/img/book-id-8.jpg',
  },
  {
    id: 9,
    author: 'Агата Кристи',
    title: 'Убийства по алфавиту',
    cost: '9.09',
    description:
      'В английском алфавите 26 букв. В подписи преступника, затеявшего с Эркюлем Пуаро игру при помощи писем, всего три буквы, первые, А, B и С. Он планирует совершить убийства в местах, названия которых расположены в алфавитном порядке. Задача Пуаро – разгадать замыслы убийцы и не дать ему совершить задуманные 26 преступлений.',
    img: '/img/book-id-9.jpg',
  },
  {
    id: 10,
    author: 'Агата Кристи',
    title: 'Убийство в "Восточном экспрессе"',
    cost: '9.06',
    description:
      'Находившийся в Стамбуле великий сыщик Эркюль Пуаро возвращается в Англию на знаменитом Восточном экспрессе, в котором вместе с ним едут, кажется, представители всех возможных национальностей. Один из пассажиров, неприятный американец по фамилии Рэтчетт, предлагает Пуаро стать своим телохранителем, поскольку считает, что его должны убить.Знаменитый бельгиец отмахивается от этой абсурдной просьбы. А на следующий день американца находят мертвым в своем купе, причем двери закрыты, а окно открыто. Пуаро немедленно берется за расследование – и выясняет, что купе полно всевозможных улик, указывающих... практически на всех пассажиров Восточного экспресса. Вдобавок поезд наглухо застревает в снежных заносах в безлюдном месте. Пуаро необходимо найти убийцу до того, как экспресс продолжит свой путь...',
    img: '/img/book-id-10.jpg',
  },
];

export function GET() {
  throw new Error('Function not implemented.');
}
